import * as React from "react";
import { observer } from "mobx-react";
import * as firebase from "firebase";
import {
  Header,
  Segment,
  Container,
  Menu,
  Item,
  Button,
  Icon,
  Form,
  Input,
  Select,
  Dropdown,
  Card
} from "semantic-ui-react";

import FirebaseAuth from "react-firebase-auth";

const json_data = [
  {
    網站: "",
    聯絡電話: "02-27263141",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "醫療",
    地址: "臺北市信義區松德路309 號",
    年齡: "NULL",
    機構名稱: "臺北市立聯合醫院-松德院區",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-23703739",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "醫療",
    地址: "臺北市萬華區昆明街100號",
    年齡: "NULL",
    機構名稱: "臺北市立聯合醫院-林森中醫昆明院區",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-27093600",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "醫療",
    地址: "臺北市大安區仁愛路四段10號",
    年齡: "NULL",
    機構名稱: "臺北市立聯合醫院-仁愛院區",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-25523234",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "醫療",
    地址: "臺北市鄭州路145號",
    年齡: "NULL",
    機構名稱: "臺北市立聯合醫院-中興院區",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-27861288",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "醫療",
    地址: "臺北市南港區同德路87號",
    年齡: "NULL",
    機構名稱: "臺北市立聯合醫院-忠孝院區",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-28353456",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "醫療",
    地址: "臺北市士林區雨聲街105號",
    年齡: "NULL",
    機構名稱: "臺北市立聯合醫院-陽明院區",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-23889595",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "醫療",
    地址: "臺北市中華路二段33號",
    年齡: "NULL",
    機構名稱: "臺北市立聯合醫院-和平婦幼院區",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-87923311",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "醫療",
    地址: "臺北市內湖區成功路2段325號",
    年齡: "NULL",
    機構名稱: "三軍總醫院附設民眾診療服務處",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-28959808",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "醫療",
    地址: "臺北市北投區新民路60號",
    年齡: "NULL",
    機構名稱: "三軍總醫院北投分院附設民眾診療服務處",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-28757027",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "醫療",
    地址: "臺北市北投區石牌路2段201號",
    年齡: "NULL",
    機構名稱: "臺北榮民醫院",
    處置方式: "門診,住院",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-28332211",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "醫療",
    地址: "臺北市士林區文昌路95號",
    年齡: "NULL",
    機構名稱: "新光醫療財團法人新光吳火獅紀念醫院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-27718151",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "醫療",
    地址: "臺北市松山區八德路2段424號",
    年齡: "NULL",
    機構名稱: "基督復臨安息日會醫療財團法人臺安醫院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-29307930",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "醫療",
    地址: "臺北市文山區興隆路3段111號",
    年齡: "NULL",
    機構名稱: "臺北市立萬芳醫院-委託財團法人臺北醫學大學辦理",
    處置方式: "門診,住院",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-27372181",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "醫療",
    地址: "臺北市信義區吳興街252號",
    年齡: "NULL",
    機構名稱: "臺北醫學大學附設醫院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-27082121",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "醫療",
    地址: "臺北市大安區仁愛路3段280號",
    年齡: "NULL",
    機構名稱: "國泰醫療財團法人國泰綜合醫院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-23133456",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "醫療",
    地址: "臺北市中山南路7號",
    年齡: "NULL",
    機構名稱: "國立臺灣大學醫學院附設醫院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-27919696",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "醫療",
    地址: "臺北市內湖區內湖路2段360號",
    年齡: "NULL",
    機構名稱: "中國醫藥大學附設醫院臺北分院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-28587000",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "醫療",
    地址: "臺北市北投區知行路225巷12號5樓",
    年齡: "NULL",
    機構名稱: "臺北市立關渡醫院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-27135211",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "醫療",
    地址: "臺北市敦化北路199號",
    年齡: "NULL",
    機構名稱: "長庚醫療財團法人台北長庚紀念醫院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-25786677",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "醫療",
    地址: "臺北市松山區光復北路66號",
    年齡: "NULL",
    機構名稱: "博仁綜合醫院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-22193391",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "新北市",
    機構屬性: "醫療",
    地址: "新北市新店區中正路362號",
    年齡: "NULL",
    機構名稱: "財團法人天主教耕莘醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-82006600",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "新北市",
    機構屬性: "醫療",
    地址: "新北市新莊區中正路794號",
    年齡: "NULL",
    機構名稱: "衛生福利部樂生療養院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-22765566",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "新北市",
    機構屬性: "醫療",
    地址: "新北市新莊區思源路127號",
    年齡: "NULL",
    機構名稱: "衛生福利部臺北醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-29829111",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "新北市",
    機構屬性: "醫療",
    地址: "新北市三重區中山路2號",
    年齡: "NULL",
    機構名稱: "新北市立聯合醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-22575152",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "新北市",
    機構屬性: "醫療",
    地址: "新北市板橋區英士路198號",
    年齡: "NULL",
    機構名稱: "新北市立聯合醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-22015222",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "新北市",
    機構屬性: "醫療",
    地址: "新北市新莊區瓊林路100巷27號",
    年齡: "NULL",
    機構名稱: "財團法人台灣省私立台北仁濟院附設新莊仁濟醫院",
    處置方式: "門診,住院",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-28094661",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "新北市",
    機構屬性: "醫療",
    地址: "新北市淡水區民生路45號",
    年齡: "NULL",
    機構名稱: "財團法人基督教長老教會馬偕紀念醫院淡水分院",
    處置方式: "門診,住院,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-26101660",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "新北市",
    機構屬性: "醫療",
    地址: "新北市八里區華富山33號",
    年齡: "NULL",
    機構名稱: "衛生福利部八里療養院",
    處置方式: "門診,住院",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-22745250",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "新北市",
    機構屬性: "醫療",
    地址: "新北市土城區青雲路6號",
    年齡: "NULL",
    機構名稱: "衛生福利部八里療養院附設土城門診部",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-26209199",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "新北市",
    機構屬性: "醫療",
    地址: "新北市淡水區忠寮里演戲埔腳1之2號",
    年齡: "NULL",
    機構名稱: "北新醫院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-26723456",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "新北市",
    機構屬性: "醫療",
    地址: "新北市三峽區復興路399號",
    年齡: "NULL",
    機構名稱: "行天宮醫療志業醫療財團法人恩主公醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-22490088",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "新北市",
    機構屬性: "醫療",
    地址: "新北市中和區中正路291號",
    年齡: "NULL",
    機構名稱: "衛生福利部雙和醫院(委託臺北醫學大學興建經營)",
    處置方式: "門診,住院,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-66289779",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "新北市",
    機構屬性: "醫療",
    地址: "新北市新店區建國路289號",
    年齡: "NULL",
    機構名稱: "財團法人佛教慈濟綜合醫院台北分院",
    處置方式: "門診,住院,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-89667000",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "新北市",
    機構屬性: "醫療",
    地址: "新北市板橋區南雅南路2段21號",
    年齡: "NULL",
    機構名稱: "醫療財團法人徐元智先生醫藥基金會亞東紀念醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-26482121",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "新北市",
    機構屬性: "醫療",
    地址: "新北市汐止區建成路59巷2號",
    年齡: "NULL",
    機構名稱: "國泰醫療財團法人汐止國泰綜合醫院",
    處置方式: "門診,住院",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-22730199",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "新北市",
    機構屬性: "醫療",
    地址: "新北市土城區裕民路82號",
    年齡: "NULL",
    機構名稱: "永康身心診所",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-29743029",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "新北市",
    機構屬性: "醫療",
    地址: "新北市三重區重新路三段132號",
    年齡: "NULL",
    機構名稱: "安興精神科診所",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-9308010",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "宜蘭縣",
    機構屬性: "醫療",
    地址: "宜蘭縣壯圍鄉古亭村（路）23-9號",
    年齡: "NULL",
    機構名稱: "海天醫療社團法人海天醫院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-9544106",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "宜蘭縣",
    機構屬性: "醫療",
    地址: "宜蘭縣羅東鎮中正南路160號",
    年齡: "NULL",
    機構名稱: "財團法人天主教靈醫會羅東聖母醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-9325192",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "宜蘭縣",
    機構屬性: "醫療",
    地址: "宜蘭縣宜蘭市新民路160號",
    年齡: "NULL",
    機構名稱: "國立陽明大學附設醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-9543131",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "宜蘭縣",
    機構屬性: "醫療",
    地址: "宜蘭縣羅東鎮南昌街81-83號",
    年齡: "NULL",
    機構名稱: "醫療財團法人羅許基金會羅東博愛醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-9222141",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "宜蘭縣",
    機構屬性: "醫療",
    地址: "宜蘭縣員山鄉內城村榮光路386號",
    年齡: "NULL",
    機構名稱: "臺北榮民總醫院員山分院",
    處置方式: "門診,住院,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-9905106",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "宜蘭縣",
    機構屬性: "醫療",
    地址: "宜蘭縣蘇澳鎮濱海路301號",
    年齡: "NULL",
    機構名稱: "臺北榮民總醫院蘇澳分院",
    處置方式: "門診,住院,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-9220292",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "宜蘭縣",
    機構屬性: "醫療",
    地址: "宜蘭縣員山鄉深溝村尚深路91號",
    年齡: "NULL",
    機構名稱: "宜蘭普門醫療財團法人普門醫院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-24259391",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "基隆市",
    機構屬性: "醫療",
    地址: "基隆市信義區信二路268號",
    年齡: "NULL",
    機構名稱: "衛生福利部基隆醫院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-24313131",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "基隆市",
    機構屬性: "醫療",
    地址: "基隆市安樂區麥金路222號",
    年齡: "NULL",
    機構名稱: "長庚醫療財團法人基隆長庚紀念醫院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-24696688",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "基隆市",
    機構屬性: "醫療",
    地址: "基隆市中正區調和街210號",
    年齡: "NULL",
    機構名稱: "維德醫療社團法人基隆維德醫院",
    處置方式: "門診,住院",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "02-24322522",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "基隆市",
    機構屬性: "醫療",
    地址: "基隆市安樂區基金一路129巷8號",
    年齡: "NULL",
    機構名稱: "暘基醫院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "082-332546",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "金門縣",
    機構屬性: "醫療",
    地址: "金門縣金湖鎮新市里復興路2號",
    年齡: "NULL",
    機構名稱: "衛生福利部金門醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-5943248",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "新竹縣",
    機構屬性: "醫療",
    地址: "新竹縣竹東鎮至善路52號",
    年齡: "NULL",
    機構名稱: "國立臺灣大學醫學院附設醫院竹東分院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-5962134轉625",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "新竹縣",
    機構屬性: "醫療",
    地址: "新竹縣竹東鎮中豐路一段81號",
    年齡: "NULL",
    機構名稱: "臺北榮民總醫院新竹分院",
    處置方式: "門診,住院,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-5993500",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "新竹縣",
    機構屬性: "醫療",
    地址: "新竹縣湖口鄉忠孝路29號",
    年齡: "NULL",
    機構名稱: "天主教仁慈醫療財團法人仁慈醫院",
    處置方式: "門診,住院,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-5476399",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "新竹縣",
    機構屬性: "醫療",
    地址: "新竹縣關西鎮新富里11鄰石門33之1號",
    年齡: "NULL",
    機構名稱: "培靈關西醫院",
    處置方式: "門診,住院",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-5942371",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "新竹縣",
    機構屬性: "醫療",
    地址: "新竹縣竹東鎮東榮路2號1樓",
    年齡: "NULL",
    機構名稱: "陽光精神科診所",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-3698553",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "桃園市",
    機構屬性: "醫療",
    地址: "桃園市龍壽街71號",
    年齡: "NULL",
    機構名稱: "衛生福利部桃園療養院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-3384889",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "桃園市",
    機構屬性: "醫療",
    地址: "桃園市成功路三段100號",
    年齡: "NULL",
    機構名稱: "臺北榮民總醫院桃園分院",
    處置方式: "替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-4799595",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "桃園市",
    機構屬性: "醫療",
    地址: "桃園市龍潭區中興路168號",
    年齡: "NULL",
    機構名稱: "國軍桃園總醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-3281200",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "桃園市",
    機構屬性: "醫療",
    地址: "桃園市龜山區舊路村頂湖路123號",
    年齡: "NULL",
    機構名稱: "長庚醫療財團法人桃園長庚紀念醫院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-3281200",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "桃園市",
    機構屬性: "醫療",
    地址: "桃園市龜山區復興街5號",
    年齡: "NULL",
    機構名稱: "長庚醫療財團法人林口長庚紀念醫院",
    處置方式: "門診,住院,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-4899242",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "桃園市",
    機構屬性: "醫療",
    地址: "桃園市龍潭區中正路298號",
    年齡: "NULL",
    機構名稱: "楊延壽診所",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-3179599",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "桃園市",
    機構屬性: "醫療",
    地址: "桃園市經國路168號",
    年齡: "NULL",
    機構名稱: "敏盛綜合醫院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-3117733",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "桃園市",
    機構屬性: "醫療",
    地址: "桃園市桃園區寶山街235號",
    年齡: "NULL",
    機構名稱: "晨暘診所",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-3866511",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "桃園市",
    機構屬性: "醫療",
    地址: "桃園市大園區南港村大觀路910號",
    年齡: "NULL",
    機構名稱: "居善醫院",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-3792260",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "桃園市",
    機構屬性: "醫療",
    地址: "桃園市桃園區龍城五街62號",
    年齡: "NULL",
    機構名稱: "周孫元診所",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-5326151",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "新竹市",
    機構屬性: "醫療",
    地址: "新竹市東區經國路一段442巷25號",
    年齡: "NULL",
    機構名稱: "國立臺灣大學醫學院附設醫院新竹分院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-5348181",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "新竹市",
    機構屬性: "醫療",
    地址: "新竹市北區武陵路3號",
    年齡: "NULL",
    機構名稱: "國軍新竹地區醫院附設民眾診療處",
    處置方式: "門診,住院,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-6119595",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "新竹市",
    機構屬性: "醫療",
    地址: "新竹市光復路二段690號",
    年齡: "NULL",
    機構名稱: "財團法人馬偕紀念醫院新竹分院",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-5166746",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "新竹市",
    機構屬性: "醫療",
    地址: "新竹市新光路38號",
    年齡: "NULL",
    機構名稱: "林正修診所",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "037-676811",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "苗栗縣",
    機構屬性: "醫療",
    地址: "苗栗縣頭份鎮信義路128號",
    年齡: "NULL",
    機構名稱: "財團法人為恭紀念醫院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "037-369936",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "苗栗縣",
    機構屬性: "醫療",
    地址: "苗栗市南勢里南勢52號",
    年齡: "NULL",
    機構名稱: "大千綜合醫院南勢分院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "037-261920",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "苗栗縣",
    機構屬性: "醫療",
    地址: "苗栗市為公路747號",
    年齡: "NULL",
    機構名稱: "衛生福利部苗栗醫院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "037-856581",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "北區",
    宗教: "NULL",
    縣市: "苗栗縣",
    機構屬性: "醫療",
    地址: "苗栗縣苑裡鎮新興路78號1樓",
    年齡: "NULL",
    機構名稱: "暘明診所",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-23592525",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "臺中市",
    機構屬性: "醫療",
    地址: "臺中市西屯區中港路3段200號",
    年齡: "NULL",
    機構名稱: "臺中榮民總醫院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-22052121",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "臺中市",
    機構屬性: "醫療",
    地址: "臺中市北區育德路2號",
    年齡: "NULL",
    機構名稱: "中國醫藥大學附設醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-22621652",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "臺中市",
    機構屬性: "醫療",
    地址: "臺中市南區復興路二段11號",
    年齡: "NULL",
    機構名稱: "中山醫學大學附設醫院中興院區",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-24739595",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "臺中市",
    機構屬性: "醫療",
    地址: "臺中市南區建國北路一段110號",
    年齡: "NULL",
    機構名稱: "中山醫學大學附設醫院大慶院區",
    處置方式: "門診,住院,個別心理治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-22294411",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "臺中市",
    機構屬性: "醫療",
    地址: "臺中市西區三民路1段199號",
    年齡: "NULL",
    機構名稱: "衛生福利部臺中醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-23711129",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "臺中市",
    機構屬性: "醫療",
    地址: "臺中市西區南屯路1段158號",
    年齡: "NULL",
    機構名稱: "財團法人臺灣省私立臺中仁愛之家附設靜和醫院",
    處置方式: "門診,住院,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-22038585",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "臺中市",
    機構屬性: "醫療",
    地址: "臺中市北區育德路185,187號",
    年齡: "NULL",
    機構名稱: "維新醫療社團法人臺中維新醫院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-26888126",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "臺中市",
    機構屬性: "醫療",
    地址: "臺中市南區德富路145巷2號",
    年齡: "NULL",
    機構名稱: "宏恩醫院龍安分院",
    處置方式: "門診,住院,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-36060666",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "臺中市",
    機構屬性: "醫療",
    地址: "臺中市潭子區豐興路一段88號",
    年齡: "NULL",
    機構名稱: "財團法人佛教慈濟綜合醫院臺中分院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-26888126",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "臺中市",
    機構屬性: "醫療",
    地址: "臺中市大甲區經國路321號",
    年齡: "NULL",
    機構名稱: "光田醫療社團法人光田綜合醫院大甲院區",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-26626161",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "臺中市",
    機構屬性: "醫療",
    地址: "臺中市沙鹿區成功西街8號",
    年齡: "NULL",
    機構名稱: "童綜合醫療社團法人童綜合醫院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-25271180",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "臺中市",
    機構屬性: "醫療",
    地址: "臺中市豐原區安康路100號",
    年齡: "NULL",
    機構名稱: "衛生福利部豐原醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-23934191",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "臺中市",
    機構屬性: "醫療",
    地址: "臺中市太平區中山路2段348號",
    年齡: "NULL",
    機構名稱: "國軍臺中總醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-26202949",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "臺中市",
    機構屬性: "醫療",
    地址: "臺中市清水區東山路68之1號",
    年齡: "NULL",
    機構名稱: "陽光精神科醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-26283995",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "臺中市",
    機構屬性: "醫療",
    地址: "臺中市清水區港埠路四段195號",
    年齡: "NULL",
    機構名稱: "清濱醫院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-23939995轉121",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "臺中市",
    機構屬性: "醫療",
    地址: "臺中市太平區宜昌路420號",
    年齡: "NULL",
    機構名稱: "賢德醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-25721694",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "臺中市",
    機構屬性: "醫療",
    地址: "臺中市石岡區下坑巷41之2號",
    年齡: "NULL",
    機構名稱: "清海醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-24632000轉53626",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "臺中市",
    機構屬性: "醫療",
    地址: "臺中市臺灣大道四段966號",
    年齡: "NULL",
    機構名稱: "澄清綜合醫院中港分院",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-22586688",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "臺中市",
    機構屬性: "醫療",
    地址: "臺中市南屯區惠中路三段36號",
    年齡: "NULL",
    機構名稱: "林新醫療社團法人林新醫院",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-22511247轉12110",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "臺中市",
    機構屬性: "醫療",
    地址: "臺中市大里區東榮路483號",
    年齡: "NULL",
    機構名稱: "仁愛醫療財團法人大里仁愛醫院",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-22256362",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "臺中市",
    機構屬性: "醫療",
    地址: "臺中市中區三民路二段11號",
    年齡: "NULL",
    機構名稱: "詹東霖身心診所",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "049-2912151",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "南投縣",
    機構屬性: "醫療",
    地址: "南投縣埔里鎮鐵山路1號",
    年齡: "NULL",
    機構名稱: "埔基醫療財團法人埔里基督教醫院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "049-2990833",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "南投縣",
    機構屬性: "醫療",
    地址: "南投縣埔里鎮榮光路1號",
    年齡: "NULL",
    機構名稱: "臺中榮民總醫院埔里分院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "049-2231150",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "南投縣",
    機構屬性: "醫療",
    地址: "南投縣南投市康壽里復興路478號",
    年齡: "NULL",
    機構名稱: "衛生福利部南投醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "049-2550800",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "南投縣",
    機構屬性: "醫療",
    地址: "南投縣草屯鎮玉屏路161號",
    年齡: "NULL",
    機構名稱: "衛生福利部草屯療養院",
    處置方式: "門診,住院,替代治療,治療性社區",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-8298686",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "彰化縣",
    機構屬性: "醫療",
    地址: "彰化縣埔心鄉中正路2段80號",
    年齡: "NULL",
    機構名稱: "衛生福利部彰化醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-7238595",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "彰化縣",
    機構屬性: "醫療",
    地址: "彰化市南校街135號",
    年齡: "NULL",
    機構名稱: "彰化基督教醫療財團法人彰化基督教醫院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-7789595",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "彰化縣",
    機構屬性: "醫療",
    地址: "彰化縣鹿港鎮鹿東路2段888號",
    年齡: "NULL",
    機構名稱: "彰化基督教醫療財團法人鹿東基督教醫院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-7256166",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "彰化縣",
    機構屬性: "醫療",
    地址: "彰化市中山路1段542號",
    年齡: "NULL",
    機構名稱: "秀傳醫療社團法人秀傳紀念醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-7813888",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "彰化縣",
    機構屬性: "醫療",
    地址: "彰化縣鹿港鎮鹿工路6號",
    年齡: "NULL",
    機構名稱: "秀傳醫療財團法人彰濱秀傳紀念醫院",
    處置方式: "門診,住院",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-7223138",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "彰化縣",
    機構屬性: "醫療",
    地址: "彰化縣彰化市龍山里中山路二段874巷33號",
    年齡: "NULL",
    機構名稱: "明德醫院",
    處置方式: "門診,住院",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-7288333",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "彰化縣",
    機構屬性: "醫療",
    地址: "彰化縣彰化市福安里中山路二段271號",
    年齡: "NULL",
    機構名稱: "頤晴診所",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-7266158",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "彰化縣",
    機構屬性: "醫療",
    地址: "彰化縣彰化市五權里金馬路三段59號",
    年齡: "NULL",
    機構名稱: "修慧診所",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "04-8952031",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "中區",
    宗教: "NULL",
    縣市: "彰化縣",
    機構屬性: "醫療",
    地址: "彰化縣二林鎮大成路一段558號",
    年齡: "NULL",
    機構名稱: "彰化基督教醫療財團法人二林基督教醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "05-5323911",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "雲林縣",
    機構屬性: "醫療",
    地址: "雲林縣斗六市雲林路2段579號",
    年齡: "NULL",
    機構名稱: "國立臺灣大學醫學院附設醫院雲林分院(斗六院區)",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "05-5332121",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "雲林縣",
    機構屬性: "醫療",
    地址: "雲林縣斗六市莊敬路345號",
    年齡: "NULL",
    機構名稱: "國立成功大學醫學院附設醫院斗六分院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "05-5223788",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "雲林縣",
    機構屬性: "醫療",
    地址: "雲林縣斗六市江厝里瓦厝路159號",
    年齡: "NULL",
    機構名稱: "信安醫療社團法人信安醫院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "05-6337333",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "雲林縣",
    機構屬性: "醫療",
    地址: "雲林縣虎尾鎮新生路74號",
    年齡: "NULL",
    機構名稱: "天主教若瑟醫療財團法人若瑟醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "05-7837901",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "雲林縣",
    機構屬性: "醫療",
    地址: "雲林縣北港鎮新德路123號",
    年齡: "NULL",
    機構名稱: "中國醫藥大學北港附設醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "05-6322584",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "雲林縣",
    機構屬性: "醫療",
    地址: "雲林縣虎尾鎮東明路182號",
    年齡: "NULL",
    機構名稱: "廖寶全診所",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "05-5328600",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "雲林縣",
    機構屬性: "醫療",
    地址: "雲林縣斗六市建成路109號",
    年齡: "NULL",
    機構名稱: "何政岳診所",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "05-3621000",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "嘉義縣",
    機構屬性: "醫療",
    地址: "嘉義縣朴子市嘉朴路西段6號",
    年齡: "NULL",
    機構名稱: "長庚醫療財團法人嘉義長庚紀念醫院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "05-2648000",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "嘉義縣",
    機構屬性: "醫療",
    地址: "嘉義縣大林鎮民生路2號",
    年齡: "NULL",
    機構名稱: "財團法人佛教慈濟綜合醫院大林分院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "05-2791072",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "嘉義縣",
    機構屬性: "醫療",
    地址: "嘉義縣竹崎鄉灣橋村石麻園38號",
    年齡: "NULL",
    機構名稱: "臺中榮民總醫院灣橋分院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "05-3790600",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "嘉義縣",
    機構屬性: "醫療",
    地址: "嘉義縣朴子市永和里42-50號",
    年齡: "NULL",
    機構名稱: "衛生福利部朴子醫院",
    處置方式: "替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "05-2319090",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "嘉義市",
    機構屬性: "醫療",
    地址: "嘉義市西區北港路312號",
    年齡: "NULL",
    機構名稱: "衛生福利部嘉義醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "05-2359630",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "嘉義市",
    機構屬性: "醫療",
    地址: "嘉義市西區世賢路2段600號",
    年齡: "NULL",
    機構名稱: "臺中榮民總醫院嘉義分院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "05-2780040",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "嘉義市",
    機構屬性: "醫療",
    地址: "嘉義市東區民權路60號",
    年齡: "NULL",
    機構名稱: "財團法人天主教聖馬爾定醫院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "05-2675041",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "嘉義市",
    機構屬性: "醫療",
    地址: "嘉義市東區忠孝路539號",
    年齡: "NULL",
    機構名稱: "戴德森醫療財團法人嘉義基督教醫院",
    處置方式: "門診,住院",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "06-2795019",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "臺南市",
    機構屬性: "醫療",
    地址: "台南市仁德區中山路870巷80號",
    年齡: "NULL",
    機構名稱: "衛生福利部嘉南療養院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "06-3125101",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "臺南市",
    機構屬性: "醫療",
    地址: "台南市永康區復興里復興路427號",
    年齡: "NULL",
    機構名稱: "高雄榮民總醫院臺南分院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "06-6351131",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "臺南市",
    機構屬性: "醫療",
    地址: "台南市新營區信義街73號",
    年齡: "NULL",
    機構名稱: "衛生福利部新營醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "06-2200055",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "臺南市",
    機構屬性: "醫療",
    地址: "臺南市中西區中山路125號",
    年齡: "NULL",
    機構名稱: "衛生福利部台南醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "06-2609926",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "臺南市",
    機構屬性: "醫療",
    地址: "臺南市東區崇德路670號",
    年齡: "NULL",
    機構名稱: "臺南市立醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "06-2353535",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "臺南市",
    機構屬性: "醫療",
    地址: "臺南市北區勝利路138號",
    年齡: "NULL",
    機構名稱: "國立成功大學醫學院附設醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "06-2228116",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "臺南市",
    機構屬性: "醫療",
    地址: "臺南市南區樹林街二段442號",
    年齡: "NULL",
    機構名稱: "財團法人奇美醫院台南分院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "06-2221111",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "臺南市",
    機構屬性: "醫療",
    地址: "臺南市中西區民生路二段22號",
    年齡: "NULL",
    機構名稱: "郭綜合醫院",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "06-2383636",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "臺南市",
    機構屬性: "醫療",
    地址: "臺南市東區凱旋路39號",
    年齡: "NULL",
    機構名稱: "心樂活診所",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "06-3553111轉2212",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "臺南市",
    機構屬性: "醫療",
    地址: "臺南市安南區長和路二段66號",
    年齡: "NULL",
    機構名稱: "臺南市立安南醫院-委託中國醫藥大學興建經營",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "06-6226999",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "臺南市",
    機構屬性: "醫療",
    地址: "臺南市柳營區太康里太康201號",
    年齡: "NULL",
    機構名稱: "奇美醫療財團法人柳營奇美醫院",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "06-2812811",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "臺南市",
    機構屬性: "醫療",
    地址: "臺南市永康區中華路901號",
    年齡: "NULL",
    機構名稱: "奇美醫療財團法人奇美醫院",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "06-2719351",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "臺南市",
    機構屬性: "醫療",
    地址: "臺南市永康區永大路2段970號",
    年齡: "NULL",
    機構名稱: "仁享診所",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "06-5902336",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "南區",
    宗教: "NULL",
    縣市: "臺南市",
    機構屬性: "醫療",
    地址: "臺南市新化區中山路20號",
    年齡: "NULL",
    機構名稱: "財團法人台灣省私立台南仁愛之家附設精神療養院",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "07-3121101",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "高雄市",
    機構屬性: "醫療",
    地址: "高雄市三民區自由一路100號",
    年齡: "NULL",
    機構名稱: "高雄醫學大學附設中和紀念醫院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "07-7513171",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "高雄市",
    機構屬性: "醫療",
    地址: "高雄市苓雅區凱旋二路130號",
    年齡: "NULL",
    機構名稱: "高雄市立凱旋醫院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "07-7496779",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "高雄市",
    機構屬性: "醫療",
    地址: "高雄市苓雅區建軍路5號",
    年齡: "NULL",
    機構名稱: "國軍高雄總醫院附設民眾診療處",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "07-3422121",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "高雄市",
    機構屬性: "醫療",
    地址: "高雄市左營區大中一路386號",
    年齡: "NULL",
    機構名稱: "高雄榮民總醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "07-7030315",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "高雄市",
    機構屬性: "醫療",
    地址: "高雄市大寮區後庄村鳳屏一路509號",
    年齡: "NULL",
    機構名稱: "財團法人台灣省私立高雄仁愛之家附設慈惠醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "07-6150011",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "高雄市",
    機構屬性: "醫療",
    地址: "高雄市燕巢區角宿村義大路1號",
    年齡: "NULL",
    機構名稱: "義大醫療財團法人義大醫院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "07-7317123",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "高雄市",
    機構屬性: "醫療",
    地址: "高雄市鳥松區大埤路123號",
    年齡: "NULL",
    機構名稱: "長庚醫療財團法人高雄長庚紀念醫院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "07-6613811",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "高雄市",
    機構屬性: "醫療",
    地址: "高雄市旗山區中學路60號",
    年齡: "NULL",
    機構名稱: "衛生福利部旗山醫院",
    處置方式: "替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "07-6231829",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "高雄市",
    機構屬性: "醫療",
    地址: "高雄市岡山區岡山路314號",
    年齡: "NULL",
    機構名稱: "維心診所",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "07-3351121",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "高雄市",
    機構屬性: "醫療",
    地址: "高雄市苓雅區成功一路162號",
    年齡: "NULL",
    機構名稱: "阮綜合醫療社團法人阮綜合醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "07-5875938",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "高雄市",
    機構屬性: "醫療",
    地址: "高雄市左營區軍校路553號",
    年齡: "NULL",
    機構名稱: "國軍高雄總醫院左營分院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "07-8036783",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "高雄市",
    機構屬性: "醫療",
    地址: "高雄市小港區山明路482號",
    年齡: "NULL",
    機構名稱:
      "高雄市立小港醫院(委託財團法人私立高雄醫學大學附設中和紀念醫院經營)",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "07-5552565",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "高雄市",
    機構屬性: "醫療",
    地址: "高雄市鼓山區中華一路976號",
    年齡: "NULL",
    機構名稱: "高雄市立聯合醫院",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "07-2911101",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "高雄市",
    機構屬性: "醫療",
    地址: "高雄市前金區中華三路68號",
    年齡: "NULL",
    機構名稱:
      "高雄市立大同醫院(委託財團法人私立高雄醫學大學附設中和紀念醫院經營)",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "07-2229612",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "高雄市",
    機構屬性: "醫療",
    地址: "高雄市新興區民族二路178號",
    年齡: "NULL",
    機構名稱: "靜和醫院",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "07-6256791",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "高雄市",
    機構屬性: "醫療",
    地址: "高雄市岡山區通校路300號",
    年齡: "NULL",
    機構名稱: "樂安醫院",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "07-3412598",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "高雄市",
    機構屬性: "醫療",
    地址: "高雄市左營區自由三路176號",
    年齡: "NULL",
    機構名稱: "陽光診所",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "07-2239025",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "高雄市",
    機構屬性: "醫療",
    地址: "高雄市苓雅區大順三路197號",
    年齡: "NULL",
    機構名稱: "靜安診所",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "08-7363011",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "屏東縣",
    機構屬性: "醫療",
    地址: "屏東縣屏東市自由路270號",
    年齡: "NULL",
    機構名稱: "衛生福利部屏東醫院",
    處置方式: "替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "08-7704115",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "屏東縣",
    機構屬性: "醫療",
    地址: "屏東縣內埔鄉龍潭村昭勝路安平1巷1號",
    年齡: "NULL",
    機構名稱: "高雄榮民總醫院屏東分院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "08-8329966",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "屏東縣",
    機構屬性: "醫療",
    地址: "屏東縣東港鎮中正路1段210號",
    年齡: "NULL",
    機構名稱: "安泰醫療社團法人安泰醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "08-7211777",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "屏東縣",
    機構屬性: "醫療",
    地址: "屏東縣麟洛鄉中山路160-1號",
    年齡: "NULL",
    機構名稱: "屏安醫院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "08-7560756",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "屏東縣",
    機構屬性: "醫療",
    地址: "屏東縣屏東市大湖路58巷22號",
    年齡: "NULL",
    機構名稱: "國軍高雄總醫院附設屏東民眾診療服務處",
    處置方式: "門診,住院",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "08-7378888",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "屏東縣",
    機構屬性: "醫療",
    地址: "屏東縣屏東市瑞光路2段250號",
    年齡: "NULL",
    機構名稱: "屏安醫院附設門診部",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "08-7881777",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "屏東縣",
    機構屬性: "醫療",
    地址: "屏東縣潮州鎮新生路111號",
    年齡: "NULL",
    機構名稱: "泰祥診所",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "08-7346666",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "屏東縣",
    機構屬性: "醫療",
    地址: "屏東縣屏東市自由路463號",
    年齡: "NULL",
    機構名稱: "興安診所",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "08-7333555",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "屏東縣",
    機構屬性: "醫療",
    地址: "屏東縣屏東市中山路40號",
    年齡: "NULL",
    機構名稱: "寬心診所",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "08-7368686",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "屏東縣",
    機構屬性: "醫療",
    地址: "屏東縣屏東市大連路60號",
    年齡: "NULL",
    機構名稱: "屏基醫療財團法人屏東基督教醫院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "08-8892704",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "屏東縣",
    機構屬性: "醫療",
    地址: "屏東縣恆春鎮恆南路188號",
    年齡: "NULL",
    機構名稱: "衛生福利部恆春旅遊醫院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "08-7705115",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "屏東縣",
    機構屬性: "醫療",
    地址: "屏東縣潮州鎮新生路111號",
    年齡: "NULL",
    機構名稱: "佑青醫療財團法人佑青醫院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "06-9261151",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "高屏區",
    宗教: "NULL",
    縣市: "澎湖縣",
    機構屬性: "醫療",
    地址: "澎湖縣馬公市中正路10號",
    年齡: "NULL",
    機構名稱: "衛生福利部澎湖醫院",
    處置方式: "門診,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-8886141",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "東區",
    宗教: "NULL",
    縣市: "花蓮縣",
    機構屬性: "醫療",
    地址: "花蓮縣玉里鎮中華路448號",
    年齡: "NULL",
    機構名稱: "衛生福利部玉里醫院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-8358141",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "東區",
    宗教: "NULL",
    縣市: "花蓮縣",
    機構屬性: "醫療",
    地址: "花蓮市中正路600號",
    年齡: "NULL",
    機構名稱: "衛生福利部花蓮醫院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-8883141",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "東區",
    宗教: "NULL",
    縣市: "花蓮縣",
    機構屬性: "醫療",
    地址: "花蓮縣玉里鎮新興街91號",
    年齡: "NULL",
    機構名稱: "玉里榮民醫院",
    處置方式: "門診,住院",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-8764539",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "東區",
    宗教: "NULL",
    縣市: "花蓮縣",
    機構屬性: "醫療",
    地址: "花蓮縣鳳林鎮中正路1 段2號",
    年齡: "NULL",
    機構名稱: "鳳林榮民醫院",
    處置方式: "門診,住院",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-8561825",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "東區",
    宗教: "NULL",
    縣市: "花蓮縣",
    機構屬性: "醫療",
    地址: "花蓮市中山路三段707號",
    年齡: "NULL",
    機構名稱: "財團法人佛教慈濟綜合醫院",
    處置方式: "門診,丁基原啡因替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-8263151",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "東區",
    宗教: "NULL",
    縣市: "花蓮縣",
    機構屬性: "醫療",
    地址: "花蓮縣新城鄉嘉里村嘉里路163號",
    年齡: "NULL",
    機構名稱: "國軍花蓮總醫院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "03-8664600",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "東區",
    宗教: "NULL",
    縣市: "花蓮縣",
    機構屬性: "醫療",
    地址: "花蓮縣壽豐鄉共和村魚池52號",
    年齡: "NULL",
    機構名稱: "臺灣基督教門諾會醫療財團法人門諾醫院壽豐分院",
    處置方式: "門診,住院",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "089-342112",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "東區",
    宗教: "NULL",
    縣市: "台東縣",
    機構屬性: "醫療",
    地址: "台東縣台東市五權街1號",
    年齡: "NULL",
    機構名稱: "衛生福利部台東醫院",
    處置方式: "門診,住院,替代治療",
    性別: "NULL"
  },
  {
    網站: "",
    聯絡電話: "089-222995",
    費用: "NULL",
    更生保護法第二條: "FALSE",
    分區: "東區",
    宗教: "NULL",
    縣市: "台東縣",
    機構屬性: "醫療",
    地址: "台東縣台東市更生路1000號",
    年齡: "NULL",
    機構名稱: "臺北榮民總醫院臺東分院",
    處置方式: "門診",
    性別: "NULL"
  },
  {
    網站: "http://www.libertas.org.tw/",
    聯絡電話: "02-29363201",
    費用: "NULL",
    更生保護法第二條: "NULL",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "心理諮商",
    地址: "台北市文山區木柵路二段18號",
    年齡: "NULL",
    機構名稱: "財團法人利伯他茲教育基金會",
    處置方式: "諮商",
    性別: "NULL"
  },
  {
    網站: "http://www.flying-life.com/",
    聯絡電話: "02-28917471",
    費用: "NULL",
    更生保護法第二條: "NULL",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "中途之家",
    地址: "台北市北投區中央北路一段96號B1",
    年齡: "NULL",
    機構名稱: "社團法人中華趕路的雁全人關懷協會",
    處置方式: "住宿",
    性別: "NULL"
  },
  {
    網站: "https://www.facebook.com/ChiayiTC/",
    聯絡電話: "05-3625200",
    費用: "NULL",
    更生保護法第二條: "NULL",
    分區: "南區",
    宗教: "NULL",
    縣市: "嘉義縣",
    機構屬性: "中途之家,心理諮商",
    地址: "NULL",
    年齡: "NULL",
    機構名稱: "蛻變驛園",
    處置方式: "住宿,諮商",
    性別: "女"
  },
  {
    網站: "http://www.hda.com.tw",
    聯絡電話: "02-23889961",
    費用: "Free",
    更生保護法第二條: "FALSE",
    分區: "臺北區",
    宗教: "NULL",
    縣市: "臺北市",
    機構屬性: "心理諮商",
    地址: "台北市萬華區西昌街134號7樓",
    年齡: "NULL",
    機構名稱: "中華民國解癮戒毒協會",
    處置方式: "正念,匿名談話會,諮商",
    性別: "NULL"
  },
  {
    網站: "NULL",
    聯絡電話: "03-7361120",
    費用: "Free",
    更生保護法第二條: "TRUE",
    分區: "北區",
    宗教: "基督教",
    縣市: "苗栗縣",
    機構屬性: "中途之家",
    地址: "NULL",
    年齡: "18~65",
    機構名稱: "基督教晨曦會-苗栗三義姊妹之家",
    處置方式: "住宿",
    性別: "女"
  },
  {
    網站: "http://www.hg.org.tw/village/tabitha.aspx",
    聯絡電話: "07-2010925",
    費用: "NULL",
    更生保護法第二條: "TRUE",
    分區: "高屏區",
    宗教: "基督教",
    縣市: "高雄市",
    機構屬性: "中途之家",
    地址: "NULL",
    年齡: "18~65",
    機構名稱: "沐恩之家-多加家園",
    處置方式: "住宿",
    性別: "女"
  },
  {
    網站: "http://www.hg.org.tw/village/bethel.aspx",
    聯絡電話: "07-7230595",
    費用: "NULL",
    更生保護法第二條: "NULL",
    分區: "高屏區",
    宗教: "基督教",
    縣市: "屏東縣",
    機構屬性: "中途之家",
    地址: "NULL",
    年齡: "18~65",
    機構名稱: "沐恩之家-伯利特家園",
    處置方式: "住宿",
    性別: "男"
  },
  {
    網站: "http://www.hg.org.tw/village/adam.aspx",
    聯絡電話: "07-7230596",
    費用: "NULL",
    更生保護法第二條: "NULL",
    分區: "高屏區",
    宗教: "基督教",
    縣市: "屏東縣",
    機構屬性: "中途之家",
    地址: "NULL",
    年齡: "12~18",
    機構名稱: "沐恩之家-亞當家園",
    處置方式: "住宿",
    性別: "男"
  },
  {
    網站: "",
    聯絡電話: "NULL",
    費用: "NULL",
    更生保護法第二條: "NULL",
    分區: "NULL",
    宗教: "NULL",
    縣市: "NULL",
    機構屬性: "中途之家",
    地址: "NULL",
    年齡: "12~18",
    機構名稱: "中華民國更生少年關懷協會",
    處置方式: "住宿",
    性別: "男"
  },
  {
    網站: "",
    聯絡電話: "",
    費用: "NULL",
    更生保護法第二條: "NULL",
    分區: "北區",
    宗教: "NULL",
    縣市: "新北市",
    機構屬性: "中途之家",
    地址: "新北市泰山區明志路一段350號",
    年齡: "12~18",
    機構名稱: "新北市少年培力園(Pilot Café)",
    處置方式: "住宿",
    性別: "NULL"
  },
  {
    網站: "http://www.tccsj.org.tw/about2.php",
    聯絡電話: "",
    費用: "NULL",
    更生保護法第二條: "NULL",
    分區: "中區",
    宗教: "NULL",
    縣市: "台中市",
    機構屬性: "中途之家",
    地址: "台中市北屯區崇德路三段938號2樓",
    年齡: "7~11, 12~18",
    機構名稱: "張秀菊社會福利慈善事業基金會",
    處置方式: "住宿",
    性別: "NULL"
  },
  {
    網站: "http://www.narconon.org.tw",
    聯絡電話: "03-8671369",
    費用: "高",
    更生保護法第二條: "NULL",
    分區: "東區",
    宗教: "NULL",
    縣市: "花蓮縣",
    機構屬性: "中途之家",
    地址: "花蓮縣吉安鄉東海二街 5號",
    年齡: "NULL",
    機構名稱: "戒毒專業機構-那可拿新生活教育中心",
    處置方式: "住宿",
    性別: "NULL"
  }
];

const genderOptions = [
  { key: "m", text: "男", value: "male" },
  { key: "f", text: "女", value: "female" }
];
const drugOptions = [
  { key: "morphine", text: "嗎啡、海洛因", value: "morphine" },
  {
    key: "amphetamine",
    text: "安非他命類(安非他命及甲基安非他命)",
    value: "amphetamine"
  },
  { key: "mdma", text: "搖頭丸(MDMA及MDA)", value: "mdma" },
  { key: "thc", text: "大麻代謝物(THC)", value: "thc" },
  { key: "ketamine", text: "愷他命類(愷他命及原愷他命)", value: "ketamine" },
  { key: "other", text: "其他", value: "other" }
];
const zoneOptions = [
  { key: "none", text: "---", value: "none" },
  { key: "north", text: "北部", value: "north" },
  { key: "westm", text: "西部", value: "west" },
  { key: "south", text: "南部", value: "south" },
  { key: "east", text: "東部", value: "east" },
  { key: "kp", text: "高屏區", value: "kp" }
];
const religionOptions = [
  { key: "none", text: "無或不排斥", value: "none" },
  { key: "christian", text: "基督教", value: "christian" },
  { key: "catholicism", text: "天主教", value: "catholicism" },
  { key: "buddhism", text: "佛教", value: "buddhism" },
  { key: "taoism", text: "道教", value: "taoism" },
  { key: "nosupport", text: "排斥宗教性協助", value: "nosupport" }
];
const responseGoogle = response => {
  console.log(response);
};

export class Home extends React.Component<any, any> {
  state = {
    name: "",
    age: 0,
    gender: "",
    drug: "",
    zone: "",
    religion: "",
    angencyResult: []
  };
  scrollToSearch() {
    // TODO : scroll down
  }

  recommendFacility() {
    // json_data
    // TODO : 推薦場所 並產生資料
    this.setState({ angencyResult: json_data });
  }

  render() {
    // 登入
    //
    // Initialize Firebase
    // var config = {
    //   apiKey: "AIzaSyAYfnhC1GbxA7q-HQYDWI_6fHWNArNQ-y0",
    //   authDomain: "taiwan-drug-abstinence-p-2edf5.firebaseapp.com",
    //   databaseURL: "https://taiwan-drug-abstinence-p-2edf5.firebaseio.com",
    //   projectId: "taiwan-drug-abstinence-p-2edf5",
    //   storageBucket: "taiwan-drug-abstinence-p-2edf5.appspot.com",
    //   messagingSenderId: "933584242007"
    // };
    // firebase.initializeApp(config);
    // 服務機構入口
    // -> 註冊/登入
    // ->
    // firebase.auth().createUserWithEmailAndPassword("a4027971@gmail.com", "88888888").catch(function(error) {
    //   // Handle Errors here.
    //   var errorCode = error.code;
    //   var errorMessage = error.message;
    //   console.log(errorCode + ": " +errorMessage);
    // });

    // 註冊確認信
    // user.sendEmailVerification().then(function() {
    //   // Email sent.
    // }).catch(function(error) {
    //   // An error happened.
    // });

    // firebase
    //   .auth()
    //   .signInWithEmailAndPassword("a4027971@gmail.com", "88888888")
    //   .catch(function(error) {
    //     // Handle Errors here.
    //     var errorCode = error.code;
    //     var errorMessage = error.message;
    //   });

    // firebase.auth().onAuthStateChanged(function(user) {
    //   if (user) {
    //     console.log(user.emailVerified);
    //     // User is signed in.
    //     // TODO : signInWithRedirect
    //     // 直接get
    //     // var user = firebase.auth().currentUser;
    //     // console.log(user);
    //     // user.sendEmailVerification().then(function() {
    //     //   // Email sent.
    //     //   console.log("success");
    //     // }).catch(function(error) {
    //     //   console.log("error");
    //     //   // An error happened.
    //     // });
    //   } else {
    //     // No user is signed in.
    //   }
    // });

    // 使用 user profile
    // var user = firebase.auth().currentUser;
    // var name, email, photoUrl, uid, emailVerified;

    // if (user != null) {
    //   name = user.displayName;
    //   email = user.email;
    //   photoUrl = user.photoURL;
    //   emailVerified = user.emailVerified;
    //   uid = user.uid;  // The user's ID, unique to the Firebase project. Do NOT use
    //                    // this value to authenticate with your backend server, if
    //                    // you have one. Use User.getToken() instead.
    // }

    // 更新 user profile
    // user.updateProfile({
    //   displayName: "Jane Q. User",
    //   photoURL: "https://example.com/jane-q-user/profile.jpg"
    // }).then(function() {
    //   // Update successful.
    // }).catch(function(error) {
    //   // An error happened.
    // });

    // 更新 Email
    // user.updateEmail("user@example.com").then(function() {
    //   // Update successful.
    // }).catch(function(error) {
    //   // An error happened.
    // });
    return (
      <div>
        <Segment inverted vertical textAlign="center" className="masthead">
          <Container>
            <Menu pointing secondary inverted>
              <Item
                as="a"
                href="https://docs.google.com/spreadsheets/d/1dtw1b7XKx6y8VdusKTvCZd4Fp19yMZWTHO9t1QJQ5SE/edit#gid=838766286"
              >
                協助編輯戒毒場所資訊
              </Item>
              <Item as="a" href="/#/Form">
                服務機構入口
              </Item>
            </Menu>
          </Container>
          <Container text>
            <Header as="h1" inverted>
              戒毒好所在
            </Header>
            <h2>
              協助成癮者或觀護人、家屬、個案管理師一起為成癮者找到適合戒毒的協助機構
            </h2>
            <Button
              primary
              size="huge"
              onClick={() => {
                this.scrollToSearch();
              }}
            >
              尋求協助<Icon className="right arrow" />
            </Button>
          </Container>
        </Segment>
        <Segment>
          <Container text>
            <Form>
              <Header as="h3" dividing>
                成癮患者資料填寫
              </Header>
              <Form.Field>
                <Form.Input
                  label="暱稱"
                  placeholder="暱稱"
                  value={this.state.name}
                  onChange={(event, { value }) => {
                    this.setState({ name: value });
                  }}
                />
              </Form.Field>
              <Form.Group widths="equal">
                <Form.Input
                  label="年齡"
                  placeholder="年齡"
                  value={this.state.age}
                  onChange={(event, { value }) => {
                    this.setState({ age: value });
                  }}
                />
                <Form.Input
                  control={Select}
                  options={genderOptions}
                  value={this.state.gender}
                  onChange={(event, { value }) => {
                    this.setState({ gender: value });
                  }}
                  label="性別"
                  placeholder="性別"
                />
              </Form.Group>
              <Form.Group>
                <Dropdown
                  label="使用毒品"
                  options={drugOptions}
                  defaultValue={this.state.drug}
                  onChange={(event, { value }) => {
                    this.setState({ drug: value });
                    console.log(this.state);
                  }}
                  onAddItem={(e, { value }) => {
                    this.setState({
                      options: [{ text: value, value }, ...this.state.drug]
                    });
                  }}
                  search
                  selection
                  fluid
                  multiple
                  allowAdditions
                />
              </Form.Group>
              <Form.Group width="equal">
                <Form.Input
                  control={Select}
                  options={zoneOptions}
                  value={this.state.zone}
                  onChange={(event, { value }) => {
                    this.setState({ zone: value });
                  }}
                  label="居住地區"
                  placeholder="--"
                />
                <Form.Input
                  control={Select}
                  options={religionOptions}
                  value={this.state.religion}
                  onChange={(event, { value }) => {
                    this.setState({ religion: value });
                  }}
                  label="宗教信仰"
                  placeholder="--"
                />
              </Form.Group>
            </Form>
            <Button
              primary
              size="huge"
              onClick={() => {
                this.recommendFacility();
              }}
            >
              推薦我協助單位<Icon className="right arrow" />
            </Button>
          </Container>
        </Segment>
        {this.state.angencyResult.map((item, index) => (
          <Card
            header={item["機構名稱"]}
            meta={item["機構屬性"]}
            description={item["地址"]}
          />
        ))}
        <Segment />
      </div>
    );
  }
}
